Repository: Arthurzim1997/hashes
Catalog: po/*.po
Languages: ar

source: Hashes
ar: تجزئات

source: Identify hashing algorithms
ar: تعرَّف على خوارزميات التَّلبيد

source: Hash Identifier
ar: عَرَّافُ التجزئة

source: hash;hashcat;john;detect;identify
ar: هاش;تجزئة;تلبيد;كات;جون;كشف;تعرف;

source: This utility lets you conveniently find out what hashing algorithm has been used on a particular string.
ar: هذه الأداة تتيح لك بأريحية التعرُّف على خوارزمية التلبيد المستخدمة في نصٍّ معيَّن.

source: Features:
ar: المزايا:

source: 📺 Popularity Ratings - Most popular hashes showed first.
ar: 📺 ترتيب بالشعبية - تُعرَض الخوارزميات الأكثر شيوعًا أولاً.

source: 👵 Updated! - A new hash algorithm database is used in the identification process.
ar: 👵 مُحَدَّثَة! - يُعْتَمَد على قاعدة بيانات حديثة لخوارزميات التلبيد خلال عملية التَّعَرُّف.

source: hash
ar: تلبيد

source: hashcat
ar: هاش كات

source: john
ar: جون

source: detect
ar: كشف

source: identify
ar: تعرف

source: Main window with a valid hash string (Light Theme)
ar: التَّعَرُّف على نَصْ تجزئة صالح في النافذة الرئيسة (الوضع المضيء)

source: Main window with a valid hash string (Dark Theme)
ar: التَّعَرُّف على نَصْ تجزئة صالح في النافذة الرئيسة (الوضع المظلم)

source: Main window with a valid hash string (Small, Light Theme)
ar: التَّعَرُّف على نَصْ تجزئة صالح في النافذة الرئيسة (مُصَغَّرَة، الوضع المضيء)

source: Main window with a valid hash string (Small, Dark Theme)
ar: التَّعَرُّف على نَصْ تجزئة صالح في النافذة الرئيسة (مُصَغَّرَة، الوضع المظلم)

source: Enter a hash text
ar: أدخِل نَصْ تجزِئة

source: Waiting for input…
ar: فِي اِنتظار الإدخال…

source: Can't find an algorithm that matches your input!
ar: تعذَّر العثور على خوارزمية تُطابق مدخلاتك!

source: Copied
ar: نُسِخ

source: <b>Extended!</b>
ar: <b>مُطوَّلة!</b>

source: Hashcat
ar: هاش كات

source: John
ar: جون

source: translator-credits
ar: zefr0x https://github.com/zefr0x

source: External Libraries
ar: مكتباتٌ برمجيةٌ خارجية
